{
  "xso.title": "Xander's Sodium Options",

  "xso.category.general": "General video settings including render distance, simulation distance, brightness, GUI scale, fullscreen, and VSync.",
  "xso.category.quality": "Configure rendering quality options such as graphics mode, clouds, weather, particles, biome blending, entity distance, and shadow rendering.",
  "xso.category.performance": "Tune performance related options like chunk builder threads, CPU render-ahead limit, and other optimizations that affect frame rate.",
  "xso.category.advanced": "Advanced options for memory management and CPU/GPU synchronization. These settings are primarily useful for debugging or fine-tuning frame pacing.",

  "xso.category.sodium_extra": "Additional options provided by Sodium Extra, including animations, particles, detail toggles, and extra rendering controls not covered by Sodium itself.",
  "xso.category.moreculling": "Options for More Culling, which improves performance by skipping the rendering of hidden block faces, item frames, and other objects that aren't visible to the player.",
  "xso.category.iris": "Shader configuration for Iris, allowing you to enable, disable, and switch between installed shader packs.",
  "xso.category.xso": "Settings for Xander's Sodium Options (XSO), the mod providing this configuration screen. You can toggle the YACL overlay, enable lenient option handling, or configure crash behavior.",
  "xso.category.entity_view_distance": "Configure per-entity render distances, allowing you to control how far away different entity types are visible for better performance or visibility.",
  "xso.category.lambdynlights": "Access settings for LambDynamicLights, which provides real-time lighting for held and dropped items, as well as certain entities like creepers and glowing squids.",

  "xso.category.fallback": "Hover over an option to see its description.",

  "xso.cfg.enabled": "XSO",
  "xso.cfg.enabled.tooltip": "Configures whether XSO should override Sodium's options. When disabled, you can configure this mod through mod menu.",
  "xso.cfg.lenient_opts": "Lenient Options",
  "xso.cfg.lenient_opts.tooltip": "If XSO fails to convert an option, instead of failing to create the whole GUI, it adds a placeholder option in place of the broken option so you can continue to use XSO with an incompatible mod.",
  "xso.cfg.hard_crash": "Hard Crash",
  "xso.cfg.hard_crash.tooltip": "If XSO cannot convert the Sodium GUI for whatever reason, enabling this makes Minecraft crash completely, rather than displaying the warning and giving you the original Sodium GUI. This can be beneficial as it makes Minecraft generate a crash report whereas it only prints to latest.log with this option off.",
  "xso.cfg.external_menus": "External Menus",
  "xso.cfg.external_menus.tooltip": "When enabled, clicking on categories like Iris will open their original configuration screens instead of XSO's integrated view. Useful if you prefer the native interfaces or experience compatibility issues.",

  "xso.donation.tooltip": "Support Sodium's Development",
  "xso.donation.confirm.title": "Support Sodium",
  "xso.donation.confirm.message": "Your support helps keep Sodium's development active. Would you like to visit their Ko-fi page?",

  "xso.incompatible.button": "Option Incompatible",
  "xso.incompatible.tooltip": "This option is currently incompatible with XSO. Please make an issue to get support!",

  "options.iris.openShaderPackScreen": "Open Original Screen",
  "options.iris.openShaderPackScreen.description": "If you're having difficulty using this screen to change shaders, you can click this button to access the original Iris shaders screen.",
  "options.iris.downloadShaders": "Download Shaders",
  "options.iris.downloadShaders.description": "Click this button to open Modrinth's \"Shader Packs\" search page.",
  "options.iris.openShaderPacksFolder.description": "Click this button to open the \"shaderpacks\" folder which is where Iris loads shaderpacks.",
  "options.iris.selectedShaderPack": "Selected Shaders",
  "options.iris.selectedShaderPack.description": "The chosen shaderpack to be loaded by Iris.",
  "options.iris.enableShaders": "Enable Shaders",
  "options.iris.enableShaders.description": "Should Iris enable shader rendering?",
  "options.iris.shaderPackOptions": "If you want to edit the current shader pack's configuration you will either need to do that through the configuration file or the original Iris Shader Packs configuration screen.",

  "options.moreculling.resetcache.description": "Clears More Culling's internal cache. Useful if you experience visual glitches after changing settings."
}
